import plotly.express as px

fig = px.treemap(
    names=["Михаил Федорович", "Алексей Михайлович", "Федор", "Софья", "Иван V",
           "Анна Иоанновна", "Екатерина", "Петр I", "Екатерина I",
           "Анна Леопольдовна", "Алексей", "Анна", "Елизавета",
           "Иван VI", "Петр II", "Петр III", "Екатерина II",
           "Павел", "Александр I", "Николай I", "Александр II", "Александр III",
           "Николай II"],
    parents=["", "Михаил Федорович", "Алексей Михайлович", "Алексей Михайлович",
             "Алексей Михайлович",
             "Иван V", "Иван V", "Алексей Михайлович", "",
             "Екатерина", "Петр I", "Петр I", "Петр I",
             "Анна Леопольдовна", "Алексей", "Анна", "",
             "Петр III", "Павел", "Павел", "Николай I", "Александр II",
             "Александр III"],
    values=[32, 31, 6, 7, 14,
            10, 0, 43, 2,
            1, 0, 0, 20,
            1, 3, 1, 34,
            5, 24, 30, 26, 13, 23],
)

fig.show()
