import plotly.express as px

fig = px.funnel(
    y=["завтрак", "перекус1", "обед", "перекус2", "ужин",
       "завтрак", "перекус1", "обед", "перекус2", "ужин",
       "завтрак", "перекус1", "обед", "перекус2", "ужин",
       "завтрак", "перекус1", "обед", "перекус2", "ужин"],
    x=[15, 10, 25.4, 10, 26,
       9.8, 15, 36.2, 9.6, 7.6,
       1.9, 4, 7.1, 1.6, 1.97,
       3, 0.5, 11.7, 3, 2],
    color=["белок", "белок", "белок", "белок", "белок",
           "углеводы", "углеводы", "углеводы", "углеводы", "углеводы",
           "жир", "жир", "жир", "жир", "жир",
           "пищевые волокна", "пищевые волокна", "пищевые волокна",
           "пищевые волокна", "пищевые волокна"]
)

fig.show()
